In [1]:
import pandas as pd

In [14]:
data_frame = pd.read_csv('friend_list.csv')

In [15]:
data_frame
# 2D ARRAY, 엑셀과 유사
# NUMPY 사용, 숫자계산에 빠름

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [17]:
data_frame.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [18]:
data_frame.tail(2)

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

In [21]:
#column = series
type(data_frame.name)

pandas.core.series.Series

In [22]:
list_tmp = [1,2,3]

In [24]:
list_tmp

[1, 2, 3]

In [25]:
s1 = pd.core.series.Series([1,2,3]) #series 생성

In [26]:
s2 = pd.core.series.Series(['one','two','three'])

In [27]:
pd.DataFrame(data=dict(num=s1, word=s2)) #생성된 series들로 DataFrame형성

   num   word
0    1    one
1    2    two
2    3  three